
# 종이책 장르
PAPERBOOK_CATEGORY_MAP = {
    "전체": "001",
    "경제 경영": "001001025",
    "소설/시/희곡": "001001046",
    "사회 정치": "001001025",
    "에세이": "001001038",
    "여행": "001001008",
    "역사": "001001015",
    "예술": "001001021",
    "인문": "001001016",
    "자기계발": "001001026",
    "자연과학": "001001012",
    "IT모바일": "001001005",
    "오디오북": "001001045"
}


# EBOOK 장르
EBOOK_CATEGORY_MAP = {
    "전체": "017",
    "경제 경영": "017001047",
    "소설": "017001045",
    "사회 정치": "017001051",
    "에세이 시": "017001050",   
    "인문": "017001048",
    "자기계발": "017001054",
    "역사": "017001052",
    "예술 대중문화": "017001056",
    "자연과학": "017001055",
    "IT모바일": "017001040",
}

# 오디오북은 장르 카테고리는 없음


# 성별 / 연령대 매핑
GENDER_MAP = {"모든 성별": None, "여성": "F", "남성": "M"}
AGE_MAP = {
    "모든 연령" : None, "10대": "10", "20대": "20", 
    "30대": "30", "40대": "40", "50대 이상": "50"
}